In [9]:
import pandas as pd

In [14]:
import random
import string

def get_random_string(length):
    # choose from all lowercase letter
    letters = string.ascii_lowercase
    return ''.join(random.choice(letters) for i in range(length))

names = [get_random_string(6) for i in range(7366)]

#### **MALE**

In [6]:
category = []
cat = []
for i in range(1, 7367):
    if i <= 1360:
        category.append('Fy')
        cat.append(0.5)
        
    elif i > 1360 and i <= 3020:
        category.append('Fr')
        cat.append(0.5)
        
    elif i > 3020  and i <= 3080:
        category.append('Ht')
        cat.append(1)
        
    elif i > 3080 and i <= 3370:
        category.append('Sp')
        cat.append(0.5)
        
    elif i > 3370 and i <= 3630:
        category.append('St')
        cat.append(1)
        
    elif i > 3630 and i <= 7366:
        category.append('Ot')
        cat.append(0.5)

In [7]:
df = pd.DataFrame()
df['names'] = names
df['category'] = category

In [8]:
df

       names category
0     wpoxkt       Fy
1     fywcge       Fy
2     npvyju       Fy
3     lzqdsj       Fy
4     gcsoor       Fy
...      ...      ...
7361  nytfps       Ot
7362  pfovzz       Ot
7363  amsmvp       Ot
7364  aykdcc       Ot
7365  qptxzr       Ot

[7366 rows x 2 columns]

In [9]:
df = df.sample(frac = 1, random_state = 2021).reset_index(drop = True)

In [10]:
df['category'].value_counts()

Ot    3736
Fr    1660
Fy    1360
Sp     290
St     260
Ht      60
Name: category, dtype: int64

In [70]:
# df.to_csv('male_applicants.csv', index = False)

#### **FEMALE**

In [11]:
# 820 + 958 + 56 +80 + 100 + 1120

In [15]:
names = [get_random_string(6) for i in range(3134)]

In [16]:
category = []
cat = []
for i in range(1, 3134+1):
    if i <= 820:
        category.append('Fy')
        cat.append(0.5)
        
    elif i > 820 and i <= 1778:
        category.append('Fr')
        cat.append(0.5)
        
    elif i > 1778  and i <= 1834:
        category.append('Ht')
        cat.append(1)
        
    elif i > 1834 and i <= 1914:
        category.append('Sp')
        cat.append(0.5)
        
    elif i > 1914 and i <= 2014:
        category.append('St')
        cat.append(1)
        
    elif i > 2014 and i <= 3134:
        category.append('Ot')
        cat.append(0.5)

In [17]:
df = pd.DataFrame()
df['names'] = names
df['category'] = category

In [18]:
df

       names category
0     pvshpw       Fy
1     pxcdlo       Fy
2     ftzptf       Fy
3     kctsnz       Fy
4     qlfajn       Fy
...      ...      ...
3129  qasuvr       Ot
3130  xunznf       Ot
3131  fftkcr       Ot
3132  vsravr       Ot
3133  tfpzjz       Ot

[3134 rows x 2 columns]

In [19]:
df = df.sample(frac = 1, random_state = 2021).reset_index(drop = True)
df['category'].value_counts()

Ot    1120
Fr     958
Fy     820
St     100
Sp      80
Ht      56
Name: category, dtype: int64

In [20]:
# df.to_csv('female_applicants.csv', index = False)